load-testing/artillery/upload.yml
# Upload load test via API gateway. Use results to size upload-service replicas.
# Run: artillery run load-testing/artillery/upload.yml
# With custom target: artillery run --target http://localhost:3000 load-testing/artillery/upload.yml
config:
  target: "http://localhost:3000"
  processor: "./processor.js"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Sustained load"
    - duration: 60
      arrivalRate: 20
      name: "Spike test"
  ensure:
    maxErrorRate: 0.1
    p95: 5000

scenarios:
  - name: "Upload single resume"
    flow:
      - post:
          url: "/api/upload/single"
          beforeRequest: "setMultipartForm"
          capture:
            - json: "$.resumeId"
              as: "resumeId"
      - think: 2
      - get:
          url: "/api/upload/{{ resumeId }}/status"