load-testing/artillery/upload.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Sustained load"
    - duration: 60
      arrivalRate: 20
      name: "Spike test"
  processor: "./processor.js"

scenarios:
  - name: "Upload resumes"
    flow:
      - post:
          url: "/api/upload/single"
          beforeRequest: "setMultipartForm"
          capture:
            - json: "$.resumeId"
              as: "resumeId"
      - think: 2
      - get:
          url: "/api/upload/{{ resumeId }}/status"